tsung_logs/2t3micro/tsung_social/tsung_social.xml
<?xml version="1.0"?><tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="rich2t3micro.eba-p7hsp2c9.us-west-2.elasticbeanstalk.com" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="5" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="5" unit="second">
      <users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="3" duration="5" unit="second">
      <users arrivalrate="4" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="4" duration="5" unit="second">
      <users arrivalrate="8" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="5" duration="5" unit="second">
      <users arrivalrate="16" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="6" duration="5" unit="second">
      <users arrivalrate="32" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="7" duration="5" unit="second">
      <users arrivalrate="64" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="8" duration="5" unit="second">
      <users arrivalrate="128" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="9" duration="5" unit="second">
      <users arrivalrate="256" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="10" duration="5" unit="second">
      <users arrivalrate="512" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>
    <option name="file_server" id="accounts" value="accounts.csv"/>
  </options>

  <sessions>
    <session name="rsvp" type="ts_http" weight="1">
      <setdynvars sourcetype="file" fileid="accounts" delimiter="," order="iter">
        <var name="username"/>
        <var name="password"/>
      </setdynvars>

      <setdynvars sourcetype="file" fileid="accounts" delimiter="," order="random">
        <var name="recipient"/>
        <var name="pass"/>
      </setdynvars>
      
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->         io:format([126, $p, 126, $n, 126, $n], [DynVars]),         ok end.">
        <var name="dump"/>
      </setdynvars>

      <request>
        <http method="GET" url="/login"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/login" version="1.1" method="POST" contents="username=%%_username%%&amp;password=%%_password%%" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="2" random="true"/>

      <request>
        <http method="GET" url="/"/>
      </request>

      <thinktime value="2" random="true"/>
      
      <request>
        <http method="GET" url="/events/1"/>
      </request>

      <thinktime value="2" random="true"/>

      <request subst="true">
        <http url="/events/1/comments" version="1.1" method="POST" contents="comment[event_id]=1&amp;comment[body]=stuff&amp;comment[commenter]=%%_username%%" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="2" random="true"/>
      
      <request>
        <http method="GET" url="/"/>
      </request>

      <thinktime value="4" random="true"/>

      <request subst="true">
        <http method="POST" url="/messages" contents="message[sender]=%%_username%%&amp;message[body]=stuff&amp;message[receiver]=%%_recipient%%&amp;message[title]=test_title" content_type="application/x-www-form-urlencoded">
        </http>
      </request>

      <thinktime value="1" random="true"/>
      
      <request>
        <http method="GET" url="/"/>
      </request>

      <thinktime value="1" random="true"/>

      <request subst="true">
        <http url="/logout" version="1.1" method="DELETE" content_type="application/x-www-form-urlencoded">
        </http>
      </request>
    </session>
  </sessions>
</tsung>